app/Controllers/Cardapio.php

    public function index($restauranteId)
    {
        // Pega os itens do restaurante
        $itensCardapioModel = new \App\Models\ItensCardapioModel();
        $itens = $itensCardapioModel->where('restaurante_id', $restauranteId)->findAll();
---
SELECT *
FROM `itens_cardapio`
WHERE `restaurante_id` = '1'

    public function editar($id)
    {
        $model = new ItensCardapioModel();
        $item = $model->find($id);
---
SELECT *
FROM `itens_cardapio`
WHERE `itens_cardapio`.`id` = '2'