app/Controllers/CardapioUsuario.php

SELECT *
FROM `itens_cardapio`
WHERE `disponivel` = 'sim'
---
        public function cardapio()
        {
            $model = new \App\Models\ItensCardapioModel();
            $dados['itens_cardapio'] = $model->where('disponivel', 'sim')->findAll();