app/Controllers/Cardapio.php

    public function salvar($restauranteId)
    {
        $model = new ItensCardapioModel();

        $data = [
            'restaurante_id' => $restauranteId,
            'nome' => $this->request->getPost('nome'),
            'descricao' => $this->request->getPost('descricao'),
            'preco' => $this->request->getPost('preco'),
            'categoria' => $this->request->getPost('categoria'),
            'disponivel' => $this->request->getPost('disponivel'),
        ];

        // Aqui você pode tratar upload de imagem também

        $model->save($data);
---
INSERT INTO `itens_cardapio` (`restaurante_id`, `nome`, `descricao`, `preco`, `categoria`, `disponivel`, `criado_em`, `atualizado_em`) VALUES ('1', 'Marmita P', 'Arroz, feijão, carne de porco, batata frita.', '22.50', 'Marmita', 'sim', '2025-04-27 14:06:32', '2025-04-27 14:06:32')