app/Controllers/Pedidos.php

    public function index($restauranteId)
    {
        $pedidosModel = new \App\Models\PedidosModel();

        $pedidos = $pedidosModel->where('restaurante_id', $restauranteId)->orderBy('criado_em', 'DESC')->findAll();
---
SELECT *
FROM `pedidos`
WHERE `restaurante_id` = '4'
ORDER BY `criado_em` DESC

public function salvar()
{
    $pedidoModel   = new \App\Models\PedidosModel();
    $itemModel     = new \App\Models\ItensCardapioModel();
    $usuarioModel  = new \App\Models\UsuariosModel();
    $enderecoModel = new \App\Models\EnderecoModel();

    $itensJson  = $this->request->getPost('itens');
    $enderecoId = $this->request->getPost('endereco_id');

    if (empty($itensJson)) {
        return redirect()->back()->with('error', 'Carrinho está vazio.');
    }

    $itens = json_decode($itensJson, true);
    if (empty($itens) || !is_array($itens)) {
        return redirect()->back()->with('error', 'Itens inválidos.');
    }

    // Pega o usuário logado
    $usuarioId = session()->get('usuario_id');
    if (!$usuarioId) {
        return redirect()->back()->with('error', 'Usuário não autenticado.');
    }

    $usuario = $usuarioModel->find($usuarioId);
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '5'

    }

    // Pega endereço
    $endereco = $enderecoModel->find($enderecoId);
---
SELECT *
FROM `enderecos`
WHERE `enderecos`.`id` = '1'

        'atualizado_em'       => date('Y-m-d H:i:s'),
    ];

    if (!$pedidoModel->save($pedidoData)) {
---
INSERT INTO `pedidos` (`restaurante_id`, `usuario_id`, `cliente_nome`, `cliente_telefone`, `cliente_endereco`, `valor_total`, `status`, `criado_em`, `atualizado_em`) VALUES ('4', '5', 'José Otávio dos Santos Miguel', '(31) 98436-3321', 'Rua dos Passos, 836 - Centro, Viçosa/MG', 35.9, 'aguardando', '2025-11-19 22:01:02', '2025-11-19 22:01:02')

        $cardapio = $itemModel->find($item['id']);
        if (!$cardapio) continue;

        $itensPedidoModel->save([
            'pedido_id'      => $pedidoId,
            'cardapio_id'    => $cardapio['id'],
            'quantidade'     => $item['quantidade'],
            'preco_unitario' => $cardapio['preco'],
            'preco_total'    => $cardapio['preco'] * $item['quantidade']
        ]);
---
INSERT INTO `itens_pedido` (`pedido_id`, `cardapio_id`, `quantidade`, `preco_unitario`, `preco_total`, `criado_em`, `atualizado_em`) VALUES (4, '7', 1, '35.90', 35.9, '2025-11-19 22:01:02', '2025-11-19 22:01:02')

    public function rastrear()
    {
        $pedidoModel = new PedidosModel();
        $restauranteModel = new \App\Models\RestaurantesModel(); // Adicione este model

        $usuarioId = session()->get('usuario_id');
        if (!$usuarioId) {
            return redirect()->to('/login')->with('error', 'Você precisa estar logado');
        }

        // Busca pedidos com informações do restaurante
        $pedidos = $pedidoModel->select('pedidos.*, restaurantes.nome as restaurante_nome')
                    ->join('restaurantes', 'restaurantes.id = pedidos.restaurante_id')
                    ->where('pedidos.usuario_id', $usuarioId)
                    ->orderBy('pedidos.criado_em', 'DESC')
                    ->findAll();
---
SELECT `pedidos`.*, `restaurantes`.`nome` as `restaurante_nome`
FROM `pedidos`
JOIN `restaurantes` ON `restaurantes`.`id` = `pedidos`.`restaurante_id`
WHERE `pedidos`.`usuario_id` = '5'
ORDER BY `pedidos`.`criado_em` DESC

    public function detalhes($pedidoId)
    {
        $db = \Config\Database::connect();
        $pedidoModel = new \App\Models\PedidosModel();

        // Busca o pedido
        $pedido = $pedidoModel->find($pedidoId);
---
SELECT *
FROM `pedidos`
WHERE `pedidos`.`id` = '4'