app/Controllers/Relatorios.php

    public function index()
    {
        $relatoriosModel = new RelatoriosRestaurantesModel();

        $dados = $relatoriosModel
            ->select('relatorios_restaurantes.*, restaurantes.nome AS nome_restaurante')
            ->join('restaurantes', 'restaurantes.id = relatorios_restaurantes.restaurante_id')
            ->findAll();
---
SELECT `relatorios_restaurantes`.*, `restaurantes`.`nome` AS `nome_restaurante`
FROM `relatorios_restaurantes`
JOIN `restaurantes` ON `restaurantes`.`id` = `relatorios_restaurantes`.`restaurante_id`