app/Controllers/Relatorios.php

    public function index()
    {
        $relatorioModel = new RelatoriosRestaurantesModel();

        $data = [
            'relatorios' => $relatorioModel->orderBy('receita_total', 'DESC')->findAll(),
            'estatisticas' => $relatorioModel->getEstatisticasGerais()
        ];
---
SELECT *
FROM `relatorios_restaurantes`
ORDER BY `receita_total` DESC