app/Controllers/Restaurantes.php

SELECT *
FROM `restaurantes`
WHERE `restaurantes`.`id` = '1'
---
    public function editar($id)
        {
            $restaurante = $this->restaurantesModel->find($id);