app/Controllers/Restaurantes.php

    public function logar()
    {
        $email = $this->request->getPost('email');
        $senha = $this->request->getPost('senha');

        // Buscar o restaurante no banco
        $restauranteModel = new RestaurantesModel();
        $restaurante = $restauranteModel->where('email', $email)->first(); // <-- Aqui!!

        if ($restaurante && password_verify($senha, $restaurante['senha'])) {
            // Login bem-sucedido!

            // Salvar os dados na sessão
            session()->set([
                'restaurante_id' => $restaurante['id'],
                'restaurante_nome' => $restaurante['nome'],
                'logado' => true
            ]);

            // Redireciona para o painel
            return view('restaurantes/painel-restaurante', [
                'restauranteId' => $restaurante['id'], // <- pega o ID real do restaurante!
                'restauranteNome' => session()->get('restaurante_nome')
            ]);
---
SELECT *
FROM `restaurantes`
WHERE `email` = 'gestorcheff@gmail.com'
 LIMIT 1