app/Controllers/Usuarios.php

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '3'
SELECT *
FROM `enderecos`
WHERE `usuario_id` = '3'
---
    public function informacao()
    {
        helper('autenticacao');

        if (!isUsuarioLogado()) {
            return redirect()->to('/usuarios/login')->with('error', 'Você precisa estar logado.');
        }

        $usuarioId = session()->get('usuario_id');

        if (!$usuarioId) {
            return redirect()->to('/usuarios/login');
        }

        $usuarioModel = new UsuariosModel();
        $enderecoModel = new EnderecoModel();

        $usuario = $usuarioModel->find($usuarioId);

        if (!$usuario) {
            throw new \Exception('Usuário não encontrado');
        }

        $enderecos = $enderecoModel->where('usuario_id', $usuarioId)->findAll();