app/Models/RelatoriosRestaurantesModel.php

    public function getEstatisticasGerais()
    {
        return $this->select('SUM(total_pedidos) as total_pedidos,
                            SUM(receita_total) as receita_total,
                            AVG(avaliacao_media) as avaliacao_media')
                   ->first();
---
SELECT SUM(total_pedidos) as total_pedidos, SUM(receita_total) as receita_total, AVG(avaliacao_media) as avaliacao_media
FROM `relatorios_restaurantes`
 LIMIT 1